[33ma79f6b5[m[33m ([m[1;36mHEAD[m[33m -> [m[1;32mmain[m[33m, [m[1;31morigin/main[m[33m)[m Medicine.cs: Добавлена проверка рецептов и статусы
[33m846ea27[m Medicine.cs: Реализована проверка корректности данных
[33m25e53d6[m Medicine.cs: Добавлена базовая структура и поле ExpiryDate
[33m48f460d[m Добавлен новый .gitignore
[33mfc7d268[m README.md
[33m5188687[m README.md
[33mdf3dd81[m Merge branch 'main' of https://github.com/qinshy0/Apteka
[33m46ab508[m .csproj файл
[33ma4a9b72[m Добавлен подробный README.md с инструкциями
[33md6d0225[m Добавлен .gitignore
[33m10dd216[m Список выполненных TODO
[33m4944d87[m полный код Customer.cs
[33m7f38695[m Добавлено поле DiscountCategory для льготной категории
[33m0d8654f[m Initial commit: Базовая структура аптеки
